# сохранение и изменение данных
## описание ... Отредиление ...
# создание новых переменных
name = "Harry"
age = 10
# изменение сохранённых данных в переменной
age = 11
# ввод данных
# описание ...
country = input("Из какой вы страны? ")
city = input()
# вывод данных на экран
## описание ...
print(name, "возраст", age)  # вывод  данных через пробел
print(f"{name} {age} лет.")
# типы данных
# описание ... Отредиление ...
year = 2025  # целое число (int)
pi = 3.14  #  реальное число (float)
month = "Январь"  # текст (str)
# работа с текстом
book = "властелин колец и братство кольца"
print(len(book))  # подсчет общего количества букв
print(book.count("а"))  # Подсчет количества буков "а".
print(book.upper())
print(book.lower())

# математические вычисления
# условия
# циклы
# работа с коллекциями данных
# функции
# работа с файлами
# библиотеки
# список терминов
